# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Duelling Signals: Differentiable DSP in Faust
#+AUTHOR: Thomas Rushton --- Équipe Emeraude

#+OPTIONS: num:nil toc:nil reveal_width:1200 ^:{}
#+EXPORT_FILE_NAME: index
#+PROPERTY: header-args:faust :line-numbers false
#+PROPERTY: header-args:css :tangle yes :results none :exports none
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_THEME: white
#+REVEAL_PLUGINS: (math)
#+REVEAL_EXTRA_CSS: phd-day-2024.css
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_MAX_SCALE: 1.0
# #+REVEAL_HIGHLIGHT_CSS: %r/plugin/highlight/monokai.css
# #+REVEAL_HIGHLIGHT_CSS: %r/node_modules/highlight.js/styles/zenburn.css
# #+REVEAL_EXTRA_SCRIPTS: <script src="https://cdn.jsdelivr.net/npm/@grame/faust-web-component@0.3.2/dist/faust-web-component.js" defer></script>
#+REVEAL_EXTRA_SCRIPTS: ("faust-web-component.js" "faust-stop-on-slidechanged.js")
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h2>%s</h2><h3>%a</h3>
#+REVEAL_EXTRA_OPTIONS: hash: true, fragmentInURL: true

* About This Presentation                                          :noexport:

This =org= file describes my presentation for the 2024 CITI lab PhD Day.

** Dependencies

- =org-re-reveal= ([[https://gitlab.com/oer/org-re-reveal/-/tree/main][gitlab]]), which enables export support from Org to [[https://revealjs.com/][Reveal.js]].
- =faust-web-component.js=, which provides a customised version of the
  ~<faust-editor>~ [[https://github.com/grame-cncm/faust-web-component][web component]] with support for specifying
  attributes and styling the content area of the component.
- =ob-faust= ([[https://github.com/hatchjaw/ob-faust][github]]), which adds (basic) support for Faust to Org Babel.
- Emacs =faust-mode=, modified slightly to fix syntax highlighting in
  source blocks.

** Running the Presentation

Tangle CSS, including the following:

#+begin_src css
.org-src-container > pre {
    padding: 1em;
    width: 66.6%;
}

.faust-editor-wrap {
    font-size: 1.75rem;
}
#+end_src

Then, from the reveal.js directory (=../reveal.js=), run:

#+begin_src shell :noeval :exports code
npm start -- --root=../
#+end_src

Then navigate to [[localhost:8000/phd-day-2024/]].

* Differentiable Programming

- Differentiate a program (analytically) with respect to its inputs
  + Automatic differentiation (AD)
- Compute the sensitivity of a program's outputs to changes in its
  inputs
  
\begin{equation*}
\frac{\partial y}{\partial\mathbf{x}} = \begin{bmatrix}\frac{\partial y}{\partial x_1} \\
\vdots \\
\frac{\partial y}{\partial x_N}\end{bmatrix}
\end{equation*}

#+REVEAL: split

- Key to gradient-based optimisation problems
- Native support in some languages, e.g. Swift
- Support via libraries in Python, Julia, etc.

* Differentiable DSP

- Application of differentiable programming to audio tasks
  + Source separation
  + Timbre transfer
  + Parameter estimation, etc.
- Possible in Faust via the DawDreamer project
  + Transpilation of Faust to Python
  + AD via JAX

* The Faust Programming Language

Faust is a domain-specific, functional programming language for
digital signal processing and audio synthesis.

#+ATTR_REVEAL: :frag (appear)
- Syntax describes a /circuit/ through which /signals/ propagate
- (Almost) everything in Faust is a signal, or something that operates
  on signals
- Compiles to C++
  #+ATTR_REVEAL: :frag t
  + ...or Webassembly, or Rust, or Java...
- Great for audio; less great for... doing your taxes 🤷
- Only maniacs write audio code in Python

** A basic Faust program

- Two input signals — implicit
- One output signal: the sum of the inputs

#+begin_src faust :results html :exports results :tab svg :sizes 50,50 :class add
process = +;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="add">
<!--
process = +;
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.add::part(editor) {
    height: 6em;
}
#+end_src

** A basic Faust synthesiser

- /Zero/ input signals; two outputs (because ~<: _,_~ )

#+begin_src faust :results html :exports results :tab ui :class synth
import("stdfaust.lib");
process = sum(i, 10, os.osc(220*((i+1)^1.8)) : *(1/(i+1))) 
    : *(en.are(.025, 2.5, button("gate")))
    : *(.5)
    <: _,_;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="ui" lineNumbers="false" class="synth">
<!--
import("stdfaust.lib");
process = sum(i, 10, os.osc(220*((i+1)^1.8)) : *(1/(i+1))) 
    : *(en.are(.025, 2.5, button("gate")))
    : *(.5)
    <: _,_;
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.synth::part(editor)
{
    height: 10em;
}
#+end_src

** A recursive Faust program

- One input
  + The other input to ~+~ is taken from the recursive path
- One output: the sum of the input and scaled, delayed copy of the
  recursed output

#+begin_src faust :results html :exports results :tab svg :sizes 50,50 :class echo
process = +~(@(10000) : *(.5));
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="echo">
<!--
process = +~(@(10000) : *(.5));
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.echo::part(editor)
{
    height: 10em;
}
#+end_src

* DDSP in Faust

** A Differentiable Primitive

#+begin_src faust :results silent
process = +;
#+end_src

#+ATTR_REVEAL: :frag t
$y = u + v$

#+ATTR_REVEAL: :frag t
Differentiate wrt. $x$:
\[
\frac{dy}{dx} = \frac{d}{dx}\left(u + v\right) = \frac{du}{dx} +
\frac{dv}{dx}
\]

#+REVEAL: split

- We can represent the addition and its derivative in parallel

#+begin_src faust :results html :exports results :tab svg :sizes 50,50 :class dual-add
process = +,+;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[50,50]" tab="svg" lineNumbers="false" class="dual-add">
<!--
process = +,+;
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.dual-add::part(editor)
{
    height: 7.5em;
}
#+end_src

#+ATTR_REVEAL: :frag t
\begin{align*}
\langle y, \frac{dy}{dx} \rangle
&= \langle u, \frac{du}{dx} \rangle + \langle v, \frac{dv}{dx} \rangle \\
&= \langle u + v, \frac{du}{dx} + \frac{dv}{dx} \rangle
\end{align*}

#+ATTR_REVEAL: :frag t
Dual number \rightarrow */Dual signal/*

** /Where's the derivative?/

#+REVEAL: split

It's assumed that each derivative has been calculated elsewhere

We need to define a derivative for /every/ primitive.

#+begin_src faust :results html :exports results :tab svg :sizes 45,55 :class dual-add-again
x = hslider("x", 0, -1, 1, .1);
u = _;
v = x;
dudx = 0;
dvdx = 1;
process = u,v,dudx,dvdx : +,+;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="dual-add-again">
<!--
x = hslider("x", 0, -1, 1, .1);
u = _;
v = x;
dudx = 0;
dvdx = 1;
process = u,v,dudx,dvdx : +,+;
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.dual-add-again::part(editor)
{
    height: 14em;
}
#+end_src

** Making it /Automatic/

#+begin_src faust :results silent
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
#+end_src

#+ATTR_REVEAL: :frag t
#+begin_src faust :results silent
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
#+end_src

#+REVEAL: split

#+begin_src faust :results html :exports results :tab svg :sizes 33,67 :class dual-add-again
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
process = diffInput,diffSlider : diffAdd;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="dual-add-again">
<!--
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
process = diffInput,diffSlider : diffAdd;
-->
</faust-editor>
</div>
#+end_export

** Multivariate Problems

*** Variable gain and DC offset

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class multivariate
x1 = hslider("gain", .5, 0, 1, .1);
x2 = hslider("dc", 0, -1, 1, .1);
process = _,x1 : *,x2 : +;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="multivariate">
<!--
x1 = hslider("gain", .5, 0, 1, .1);
x2 = hslider("dc", 0, -1, 1, .1);
process = _,x1 : *,x2 : +;
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.multivariate::part(editor)
{
    height: 9em;
}
#+end_src

\[y = uv + w, \quad v = x_1, \quad w = x_2\]

#+ATTR_REVEAL: :frag t
\[
y' = \frac{\partial y}{\partial \mathbf{x}}
= \begin{bmatrix}\frac{\partial y}{\partial x_1} \\
\frac{\partial y}{\partial x_2}\end{bmatrix}
\]

*** Dual Signal Representation

\begin{align*}
\langle y,y' \rangle &=
\langle u,u' \rangle \langle v,v' \rangle + \langle w,w' \rangle \\
&= \langle uv,u'v + v'u \rangle + \langle w,w' \rangle \\
&= \langle uv + w,u'v + v'u + w'\rangle
\end{align*}

*** Implementation in Faust

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class gain-dc
NVARS = 2;
x1 = diffSlider(NVARS,1,.5,0,1,.1);
x2 = diffSlider(NVARS,2,0,-1,1,.1);
process = diffInput(NVARS),x1 : diffMul(NVARS),x2 : diffAdd(NVARS);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="gain-dc">
<!--
NVARS = 2;
x1 = diffSlider(NVARS,1,.5,0,1,.1);
x2 = diffSlider(NVARS,2,0,-1,1,.1);
process = diffInput(NVARS),x1 : diffMul(NVARS),x2 : diffAdd(NVARS);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.gain-dc::part(editor)
{
    height: 25em;
}
#+end_src

** Gradient Descent

- Run a ground truth algorithm in parallel with a /learnable/ one
- Compare $y$ and $\hat{y}$ via a loss function
  + L1-norm, time-domain

\[
\mathcal{L}(y,\hat{y}) = ||y-\hat{y}||
\]

#+REVEAL: split

- Gradient found as the derivative of the loss function
  wrt. $\mathbf{x}$ at time $t$
- Scaled gradients subtracted from parameters to get $\mathbf{x}_{t+1}$

\begin{align*}
\mathbf{x}_{t+1} &= \mathbf{x}_t - \alpha\frac{\partial\mathcal{L}}{\partial \mathbf{x}_t} \\
&= \mathbf{x}_t - \alpha\frac{\partial y}{\partial \mathbf{x}_t}\frac{y-\hat{y}}{|y-\hat{y}|}
\end{align*}

*** Differentiable variables

#+ATTR_REVEAL: :frag (appear)
- We take an inverted approach
- Now sliders are /ground truth/ variables, and bargraphs are
  /learnable/ variables

#+ATTR_REVEAL: :frag t
#+begin_src faust :results silent
diffVar(nvars,I,graph) = -~_
    <: attach(graph),par(i,nvars,i+1==I);
#+end_src

#+ATTR_REVEAL: :frag t
This handles the subtraction of the scaled gradient

*** A Grand Recursion

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class gain-dc-full
import("stdfaust.lib");

process = os.osc(440.) 
    : hgroup("DDSP",(route(1+NVARS,2+NVARS,(1+NVARS,1),(1+NVARS,2),par(i,NVARS,(i+1,i+3))) 
        : hgroup("[0]Parameters",groundTruth,learnable)
        : route(2+NVARS,4+NVARS,(1,1),(2,2),(1,3),(2,4),par(i,NVARS,(i+3,i+5))) 
        : vgroup("[1]Loss & Gradients",loss,gradients)
    )) ~ (!,si.bus(NVARS))
with {
    groundTruth = vgroup("Hidden", 
        _,hslider("[0]gain",.5,0,1,.1) : *,hslider("[1]DC",-.5,-1,1,.1) : +
    );

    NVARS = 2;

    x1 = diffVar(NVARS,1,hbargraph("[0]gain", 0, 1));
    x2 = diffVar(NVARS,2,hbargraph("[1]DC", -1, 1));
    learnable = vgroup("Learned", diffInput(NVARS),x1,_ : diffMul(NVARS),x2 : diffAdd(NVARS));

    loss = ro.cross(2) : - : abs <: attach(hbargraph("[1]loss",0.,2));
    alpha = hslider("[0]Learning rate [scale:log]", 1e-4, 1e-6, 1e-1, 1e-6);
    gradients = (ro.cross(2): -),si.bus(NVARS)
        : route(NVARS+1,2*NVARS+1,(1,1),par(i,NVARS,(1,i*2+3),(i+2,2*i+2)))
        : (abs,1e-10 : max),par(i,NVARS, *)
        : route(NVARS+1,NVARS*2,par(i,NVARS,(1,2*i+2),(i+2,2*i+1)))
        : par(i,NVARS, /,alpha : * <: attach(hbargraph("gradient %i",-1e-2,1e-2)));
};

diffVar(nvars,I,graph) = -~_ <: attach(graph),par(i,nvars,i+1==I);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="false" class="gain-dc-full">
<!--
import("stdfaust.lib");

process = os.osc(440.) 
    : hgroup("DDSP",(route(1+NVARS,2+NVARS,(1+NVARS,1),(1+NVARS,2),par(i,NVARS,(i+1,i+3))) 
        : hgroup("[0]Parameters",groundTruth,learnable)
        : route(2+NVARS,4+NVARS,(1,1),(2,2),(1,3),(2,4),par(i,NVARS,(i+3,i+5))) 
        : vgroup("[1]Loss & Gradients",loss,gradients)
    )) ~ (!,si.bus(NVARS))
with {
    groundTruth = vgroup("Hidden", 
        _,hslider("[0]gain",.5,0,1,.1) : *,hslider("[1]DC",-.5,-1,1,.1) : +
    );

    NVARS = 2;

    x1 = diffVar(NVARS,1,hbargraph("[0]gain", 0, 1));
    x2 = diffVar(NVARS,2,hbargraph("[1]DC", -1, 1));
    learnable = vgroup("Learned", diffInput(NVARS),x1,_ : diffMul(NVARS),x2 : diffAdd(NVARS));

    loss = ro.cross(2) : - : abs <: attach(hbargraph("[1]loss",0.,2));
    alpha = hslider("[0]Learning rate [scale:log]", 1e-4, 1e-6, 1e-1, 1e-6);
    gradients = (ro.cross(2): -),si.bus(NVARS)
        : route(NVARS+1,2*NVARS+1,(1,1),par(i,NVARS,(1,i*2+3),(i+2,2*i+2)))
        : (abs,1e-10 : max),par(i,NVARS, *)
        : route(NVARS+1,NVARS*2,par(i,NVARS,(1,2*i+2),(i+2,2*i+1)))
        : par(i,NVARS, /,alpha : * <: attach(hbargraph("gradient %i",-1e-2,1e-2)));
};

diffVar(nvars,I,graph) = -~_ <: attach(graph),par(i,nvars,i+1==I);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.gain-dc-full::part(editor)
{
    height: 12em;
}
#+end_src

\[
\mathcal{L}(y,\hat{y}) = ||y-\hat{y}|| \\
\mathbf{x}_{t+1} = \mathbf{x}_t - \alpha\frac{\partial y}{\partial \mathbf{x}_t}\frac{y-\hat{y}}{|y-\hat{y}|}
\]

We're /sonifying/ the loss function.

* Improvements

#+begin_src faust :results silent
df = library("diff.lib");
#+end_src

** Setting up a Differentiable Environment

#+begin_src faust :results silent
// diff.lib
vars(vars) = environment {
    N = outputs(vars);
    var(i) = ba.take(i,vars),pds(N,i)
    with {
        pds(N,i) = par(j,N,i-1==j);
    };
};

// my.dsp
df = library("diff.lib");

vars = df.vars((x1,x2))
with {
    x1 = -~_ <: attach(hbargraph("x1",0,1));
    x2 = -~_ <: attach(hbargraph("x2",0,1));
};

d = df.env(vars);
#+end_src

#+ATTR_REVEAL: :frag t
No longer necessary to pass ~NVARS~ to every primitive 👏

** Using the Differentiable Environment

#+begin_src faust :results silent
groundTruth = _,gain,dc 
    : *,_ 
    : +
with {
    gain = hslider("[0]Gain", .5, 0, 2, .01);
    dc = hslider("[1]DC", .5, -1, 1, .01);
};

vars = df.vars((gain,dc))
with {
    gain = -~_ <: attach(hbargraph("[5]Gain",0,2));
    dc = -~_ <: attach(hbargraph("[6]DC",-1,1));
};

d = df.env(vars);

learnable = d.input,vars.var(1),vars.var(2)
    : d.diff(*),d.diff(_)
    : d.diff(+);
#+end_src

Makes use of Faust's /pattern-matching/ feature

* Some Examples

Time to switch to the Faust Web IDE...

* Limitations

#+ATTR_REVEAL: :frag (appear)
- These are basic demonstrations of stochastic gradient descent
- All input is deterministic
- All loss is time-domain
  + For oscillator-based examples, a phase-shift would make it much
    harder to minimise the loss function
- Learning the length of a delay isn't easy
  + Derivative of a delay wrt. $\mathbf{x}$ contains a derivative
    wrt. time
  + Important for some pretty ubiquitous audio effects (chorus, etc.) 

* Outlook

#+ATTR_REVEAL: :frag (appear)
- More loss functions, optimisers, momentum, parameter normalisation...
- Frequency-domain loss
- Reverse mode...
  + ...though Faust does a very good at optimising its compiled output
- Batched training data
- Offline training \rightarrow weights \rightarrow real-time inference
- To be developed further as a Google Summer of Code project
  
* How I made this presentation

** Emacs
#+REVEAL_HTML: <div style="float: left; width: 50%">
Pro
#+ATTR_REVEAL: :frag t
- Infinitely customisable
#+REVEAL_HTML: </div>
#+REVEAL_HTML: <div style="float: right; width: 50%">
Con
#+ATTR_REVEAL: :frag t
- Infinitely customisable
#+REVEAL_HTML: </div>

** Org Mode

#+REVEAL_HTML: <div style="float: left; width: 50%">
Pro
#+ATTR_REVEAL: :frag t
- It's just plain text
#+REVEAL_HTML: </div>
#+REVEAL_HTML: <div style="float: right; width: 50%">
Con
#+ATTR_REVEAL: :frag (appear)
- Like coding telepathically, or while wearing oven gloves
- ~C-c C-e v v~
#+REVEAL_HTML: </div>

** =ob-faust= for Faust support in Org Babel

#+ATTR_REVEAL: :frag t
#+begin_src emacs-lisp :noeval
(when (member "html" result-type)
  (setq attributes
	(concat
	 (when-let ((sizes (cdr (assoc :sizes params))))
	   (format " sizes=\"[%s]\"" sizes))
	 (when-let ((tab (cdr (assoc :tab params))))
	   (format " tab=%S" tab))
	 (when-let ((class (cdr (assoc :class params))))
	   (format " class=%S" class)))))
#+end_src

#+ATTR_REVEAL: :frag (appear)
- Emacs lisp is my new favourite language
- Just kidding

** Customised* =faust-web-component=

#+ATTR_REVEAL: :frag (appear)
- *Hacked to bits, truth be told
- /Finally/, my years as a web developer prove vaguely useful
- ~<faust-editor>~ and Reveal.js don't get along perfectly well

#+REVEAL: split

#+begin_quote
Only maniacs write audio code in Python ---T.\nbsp{}Rushton, 2024
#+end_quote
